[
  {
    "author": "Xcom-shop",
    "artName": "Илон Маск сделал бесплатным чат-бот Grok от xAI. Что он умеет и почему это круто",
    "preview": "Если вы только что вылезли из-под камня или вернулись с Марса, то вам нужно срочно знать: Grok, чат-бот Илона Маска, теперь стал доступен бесплатно. Это не просто новость, а настоящий прорыв в мире техники и общения с искусственным интеллектом. Давайте разберёмся, почему Grok – это ваш новый лучший друг и как вы можете использовать его на полную катушку.\n\n",
    "tags": [
      "Блог компании Группа компаний X-Com",
      "Искусственный интеллект",
      "Обработка изображений"
    ],
    "timeOfPublication": "Dec 19, 2024, 10:22:00 AM",
    "views": 1400,
    "readingTime": 4,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/45b/9fa/348/45b9fa348a70c72b02d0ce6aada04375.jpeg"
  },
  {
    "author": "Aza_Misakyan",
    "artName": "Django или Flask: какой фреймворк лучше подходит для вашего проекта?",
    "preview": "Flask и Django — два ведущих веб-фреймворка на языке Python, каждый из которых обладает уникальными особенностями и преимуществами. Они широко используются для создания и управления веб-приложениями, сервисами и сайтами. В этой статье мы подробно рассмотрим различия между Flask и Django, их ключевые характеристики, преимущества и недостатки, чтобы помочь вам выбрать наиболее подходящий инструмент для ваших проектов в 2024 году.\n\n",
    "tags": [
      "Django",
      "Flask"
    ],
    "timeOfPublication": "Dec 19, 2024, 10:16:00 AM",
    "views": 588,
    "readingTime": 5
  },
  {
    "author": "dennus",
    "artName": "Безопасность на высоте: как защищать API сегодня",
    "preview": "К 2030 году количество используемых в мире API составит около 2 миллиардов. Это в 8 раз больше, чем в 2018 году. Рост числа открытых точек увеличивает количество уязвимостей, угроз и прогнозируемых атак. По оценкам экспертов, к 2026–2027 годам рост прогнозируемых атак на API составит 156% от сегодняшнего состояния.\nМеня зовут Денис Кириллов, я главный архитектор решения Platform V SOWA в СберТехе. Сегодня я хотел бы рассказать о лучших практиках защиты API в современном мире. Эта тема довольно обширная, поэтому я разделил её на два материала. В первой статье рассмотрим принципы безопасности API, спецификации API и как они влияют на безопасность. Поговорим о проверке объектов на соответствие спецификации и о том, как она помогает снизить риски из списка Тор-10 API Security Risks.\nВо второй статье расскажу о проблемах валидации API и совместном использовании механизмов валидации и WAF. Выясним, почему необходим отдельный компонент, который реализовывал бы функцию безопасности по отношению к API. И рассмотрим возможности продукта Platform V SOWA, который мы создали для решения этих задач.\nМатериал будет полезен специалистам в области информационной безопасности, сопровождения и разработки.\n\n",
    "tags": [
      "Блог компании Сбер",
      "API",
      "Информационная безопасность"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:52:00 AM",
    "views": 535,
    "readingTime": 10,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/1c0/e25/e30/1c0e25e30fdbe520590370e7c9de0545.jpg"
  },
  {
    "author": "RationalAnswer",
    "artName": "Андрей Мовчан считает, что даже средний хедж-фонд смог обогнать S\u0026P500 за последние 25 лет (а я нет)",
    "preview": "Как известно, хедж-фонды платят ундециллионы денег самым умным и способным управляющим – наверное, для них не составит труда обогнать пассивный индекс акций? В этой статье мы попробуем зарыться в данные и в деталях разобраться, действительно ли это так, и в чем может быть проблема с вынесенным в заголовок тезисом.\n\n",
    "tags": [
      "Финансы в IT"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:32:00 AM",
    "views": 1600,
    "readingTime": 10,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/607/8af/938/6078af938535285aa8dbca2a412e7800.jpg"
  },
  {
    "author": "olegantipovDDG",
    "artName": "Петь в такт машине: история караоке и устройство его аппаратов",
    "preview": "Японское изобретение давно стало привычной частью нашей реальности. Многие отводят душу в караоке по вечерам, одни или в веселой компании. Задумывались ли вы когда-нибудь, как караоке-аппараты считают баллы, которые по итогам исполнения присуждаются отважным певцам? Совершим небольшое путешествие в историю этого изобретения и заглянем внутрь механизма его работы.\n\n",
    "tags": [
      "Блог компании DDoS-Guard",
      "Читальный зал",
      "Алгоритмы",
      "Звук",
      "Старое железо"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:20:00 AM",
    "views": 417,
    "readingTime": 9,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/c11/7b4/ad7/c117b4ad7b01e650b74bbad346f8afe1.jpg"
  },
  {
    "author": "Dima_cloud",
    "artName": "Как мы настроили планировщик, чтобы разогнать виртуальные серверы",
    "preview": "Секрет Полишинеля, что общая производительность нарезанного на виртуальные хосты сервера снижается. Проблема возникает, если эти потери становятся настолько значительны, что тормозят работу программ. Делюсь опытом, как нам удалось решить эту задачу. В нашем случае, серверы были настроены для работы с 1С.\n\n",
    "tags": [
      "1С",
      "Microsoft SQL Server",
      "Облачные сервисы",
      "Виртуализация",
      "Серверная оптимизация"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:15:00 AM",
    "views": 601,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/e3d/c12/e03/e3dc12e034ec17a7347129ce01e62a1a.jpg"
  },
  {
    "author": "aymericzip",
    "artName": "Интернационализация (i18n) бэкенда в Express с использованием Intlayer",
    "preview": "Недавно мне понадобилось добавить поддержку нескольких языков в API на базе Express. Я решил поделиться кратким руководством для тех, кто хочет сделать свой бэкенд отвечающим переведенным контентом в зависимости от предпочтительного языка пользователя.\n",
    "tags": [
      "JavaScript",
      "TypeScript",
      "Node.JS",
      "Веб-разработка",
      "Программирование"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:15:00 AM",
    "views": 108,
    "readingTime": 2,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/e8d/dad/bf2/e8ddadbf280a25778d368c569d51b861.png"
  },
  {
    "author": "SIISII",
    "artName": "Процессор ЭВМ ЕС-1030. Блок обращения к оперативной памяти",
    "preview": "В этой статье рассматривается устройство и логика работы блока обращения к оперативной памяти процессора ЭВМ ЕС-1030.\n\n",
    "tags": [
      "История IT",
      "Процессоры"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:13:00 AM",
    "views": 352,
    "readingTime": 21,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/e9f/5cd/8c4/e9f5cd8c48bbc6afdc3998cd8ecf89a9.jpg"
  },
  {
    "author": "gserge",
    "artName": "Менеджмент менеджмента: как во «Фланте» внедрили принятие решений эфемерными рабочими группами",
    "preview": "Впервые со сложностью согласованного принятия решений менеджеры «Фланта» столкнулись в 2022 году. Компания сильно выросла, и нужно было синхронизировать процессы в разных командах, развивать межкомандные коммуникации, продажи и управление бюджетом.\nЧисло руководителей уже не позволяло выбирать решения единогласно. Мы пробовали собрать рабочие группы по пяти основным направлениям задач, но быстро выяснилось, что их состав недостаточно гибкий. Гораздо более эффективным подходом оказались эфемерные рабочие группы для решения каждой конкретной проблемы. В статье рассказываем, как они появились и работают.\n\n",
    "tags": [
      "Блог компании Флант",
      "Agile",
      "Управление проектами",
      "Удалённая работа",
      "Управление персоналом"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:00:00 AM",
    "views": 426,
    "readingTime": 7,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/62e/554/98c/62e55498c18ba1e406a38b747ac84784.png"
  },
  {
    "author": "legalboss",
    "artName": "Cкрытое владение бизнесом в России — является ли схема преступлением по ст. 173.1 и 173.2 Уголовного кодекса РФ",
    "preview": "В сети появляется всё больше информации о незаконности схемы скрытого владения бизнесом и отождествления её с преступлениями, предусмотренными статьями 173.1 и 173.2 УК РФ. В этой статье разберём, так ли это на самом деле и как законно и безопасно оформить указанную схему на практике с помощью опциона, корпоративного и наследственного договоров.\nПоскольку абсолютное большинство компаний в России инкорпорированы в организационно-правовой форме ООО, то в данной статье я буду рассматривать скрытое владение бизнесом в контексте этого вида юридического лица.\n\n",
    "tags": [
      "Управление проектами"
    ],
    "timeOfPublication": "Dec 19, 2024, 8:56:00 AM",
    "views": 712,
    "readingTime": 12
  },
  {
    "author": "sergio_seo",
    "artName": "Удаленка против позвоночника: как выиграть в войне за здоровую спину",
    "preview": "Я работаю на удаленке и в последний год сменил уже третью съемную квартиру. Готовлюсь к покупке своей недвижимости, но терпеть неудобное рабочее место я больше не могу\n\n",
    "tags": [
      "Здоровье",
      "Удалённая работа"
    ],
    "timeOfPublication": "Dec 19, 2024, 8:16:00 AM",
    "views": 2300,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/82e/b90/990/82eb9099005bce13fb04029af81543eb.png"
  },
  {
    "author": "legalboss",
    "artName": "Архитектура бизнес-партнёрства: как юридически грамотно оформить отношения между бизнес-партнёрами в России",
    "preview": "Даже опытные предприниматели при оформлении отношений с бизнес-партнёрами нередко делают ошибки. У начинающих предпринимателей такое происходит гораздо чаще. В этой статье обозначим 8 наиболее важных принципов оформления бизнес-партнёрств, которые следует применять на практике.\n\n",
    "tags": [
      "Читальный зал"
    ],
    "timeOfPublication": "Dec 19, 2024, 8:16:00 AM",
    "views": 151,
    "readingTime": 12
  },
  {
    "author": "PatientZero",
    "artName": "Отображение веб-контента на дисплее E-Ink",
    "preview": "Недавно я занялся поиском способов существенно улучшить утренний ритуал нашей семьи: ежедневную проверку расписания в школе моих детей. Актуальное расписание можно найти или на веб-сайте школы, или через мобильное приложение VPmobil. Проблема в том, что на телефоне моего сына установлен строгий родительский контроль, из-за чего эта ежедневная неприятная процедура ложилась на мои плечи. Настало время её облегчить!\nПо сути, я задумал проапгрейдить классическое школьное расписание, приклеенное к дверце холодильника. Мне хотелось заменить бумажный листок экраном на электронных чернилах, который автоматически скачивает и отображает актуальное расписание, в том числе и ежедневные изменения. Дисплей должен работать без подключения к сети питания, а заряда аккумулятора должно хватать на много недель. Самое важное, что этот дисплей должен отображать информацию без взаимодействия с моими или детскими цифровыми устройствами.\n\n",
    "tags": [
      "Интернет вещей",
      "Разработка под Arduino",
      "Программирование микроконтроллеров",
      "Программирование"
    ],
    "timeOfPublication": "Dec 19, 2024, 8:09:00 AM",
    "views": 812,
    "readingTime": 11,
    "picURL": "https://habrastorage.org/getpro/habr/upload_files/25a/b08/370/25ab083709da3682321464621812106d.webp"
  },
  {
    "author": "badcasedaily1",
    "artName": "pg_partman: автоматизация партиционирования PostgreSQL",
    "preview": "Ситуация: у вас PostgreSQL, в котором копятся гигантские таблицы. Вы попытались их разбить по времени или по ID, но все уперлось в рутинный менеджмент: надо создавать новые партиции, чистить старые, не забыть настроить индексы... Короче, превращается это в сериал на сто сезонов. А может, вы используете встроенное декларативное партиционирование, но хочется чего-то поудобнее? Вот тут хорошо поможет pg_partman. Это расширение — фактически «менеджер по партиционированию», который сделает половину этой рутины за вас.\npg_partman — это расширение к PostgreSQL, которое упрощает декларативное партиционирование больших таблиц по времени или по числовым значениям. Не надо вручную создавать новые партиции, ломать голову над датами, выпиливать старые партиции. pg_partman сам создаст нужные секции вперед, поможет с очисткой старых, подскажет, если данные вдруг залетели в дефолтный партишн.\n\n",
    "tags": [
      "Блог компании OTUS",
      "PostgreSQL",
      "Хранение данных"
    ],
    "timeOfPublication": "Dec 19, 2024, 7:48:00 AM",
    "views": 474,
    "readingTime": 6,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/13f/e46/f7d/13fe46f7d558366b2d750f3a516310c5.png"
  },
  {
    "author": "CrabCoder",
    "artName": "Разработка специализированного графика для отображения ЭКГ с использованием Canvas на плафторме .NET for Android",
    "preview": "В современной медицине точное отображение электрокардиограммы (ЭКГ) играет ключевую роль в диагностике и мониторинге сердечно-сосудистых заболеваний. Разработка специализированного графика для визуализации ЭКГ в реальном времени на мобильных устройствах требует не только глубокого понимания медицинских стандартов, но и тщательного выбора технологий для реализации. В статье мы рассмотрим процесс создания такого графика с использованием технологии Canvas, обсудим возникшие проблемы и найденные решения.\n\n",
    "tags": [
      ".NET",
      "Разработка под Android",
      "Xamarin",
      "C#",
      "Работа с векторной графикой"
    ],
    "timeOfPublication": "Dec 19, 2024, 7:16:00 AM",
    "views": 450,
    "readingTime": 9,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/20b/ebe/1d5/20bebe1d593fe12e712feb20b7f3eb69.jpeg"
  },
  {
    "author": "arttttt",
    "artName": "Создание Custom Layout в Jetpack Compose",
    "preview": "Привет, Хабр! Меня зовут Артем и я автор и ведущий YouTube канала Android Insights\nСегодня я расскажу о том, как создавать Custom Layout в Jetpack Compose, а также мы решим одну связанную с данной темой практическую задачку. Создание Custom Layout может показаться чем-то сложным на первый взгляд, но я постараюсь все объяснить максимально понятно и подробно. Итак, приступим!\n\n",
    "tags": [
      "Разработка под Android",
      "Jetpack Compose",
      "Разработка мобильных приложений"
    ],
    "timeOfPublication": "Dec 19, 2024, 4:08:00 AM",
    "views": 365,
    "readingTime": 13
  },
  {
    "author": "heinrich_wirth",
    "artName": "Центральный Университет: взгляд магистра изнутри (1 семестр)",
    "preview": "Взгляд изнутри Центрального Университета: атмосфера, обучение, практико ориентированные курсы и почему этот вуз может стать лидером в подготовке специалистов по Data Science. Делюсь опытом первого семестра.\n\n",
    "tags": [
      "Учебный процесс в IT",
      "Карьера в IT-индустрии",
      "Будущее здесь"
    ],
    "timeOfPublication": "Dec 19, 2024, 2:45:00 AM",
    "views": 839,
    "readingTime": 9,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/3c3/b8e/88a/3c3b8e88a62b5f8e2d3fff0da9352bf9.jpg"
  },
  {
    "author": "Prikalel",
    "artName": "Godot 3.6 с поддержкой python",
    "preview": "Для особо извращённых, кому не нравится gdscript, но нравится python, кратко хотелось бы рассказать, как делать в Godot всякое при помощи своего любимого языка.\nОкружение: win, сборка игры под платформу: win. Предполагается что python (\u003e\u003d 3.7) и pip уже установлены.\n",
    "tags": [
      "Python",
      "Godot"
    ],
    "timeOfPublication": "Dec 18, 2024, 11:43:00 PM",
    "views": 2400,
    "readingTime": 4,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/abc/aed/981/abcaed981aaf682ba62b0f95707c7674.jpg"
  },
  {
    "author": "Devastator82",
    "artName": "Заметки попаданца о Руанде 2000-х",
    "preview": "Эти заметки я решил написать как расширенный комментарий к статье, которая всколыхнула почти забытое. Что увидел вчерашний московский школьник в Руанде в начале 2000-х.\n\n",
    "tags": [
      "Читальный зал",
      "Урбанизм",
      "Управление персоналом"
    ],
    "timeOfPublication": "Dec 18, 2024, 11:27:00 PM",
    "views": 4700,
    "readingTime": 13,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/0d7/923/8ca/0d79238cafc35a5c470e06a363dc30c8.jpg"
  },
  {
    "author": "ushliypakostnik",
    "artName": "RUINSWORDL: Многопользовательский шутер с открытым миром для браузера на js/ts, Three и Vue. Бета-версия",
    "preview": "Этой статьей я хочу представить сообществу разработку www.ruinsworld.ru, которой, по сути, посвятил пять последних лет жизни. Все начиналось с браузерного сингл‑шутера, потом была не очень удачная и быстро наскучившая попытка в стратегию, после чего я поставил себе, казалось бы, невозможную задачу. Реально ли, используя все эти наработки, построить многопользовательский шутер в браузере, да еще не просто «стрелялку внутри небольшой коробки», а с большим открытым миром и огромным количеством неписей в нем? Чтобы можно было «идти куда хочешь во все стороны и делать что заблагорассудится», как в самых лучших постапокалиптических РПГ?\n\n",
    "tags": [
      "TypeScript",
      "Ненормальное программирование",
      "Разработка игр",
      "WebGL",
      "Дизайн игр"
    ],
    "timeOfPublication": "Dec 18, 2024, 10:52:00 PM",
    "views": 1900,
    "readingTime": 22,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/38f/2ce/f33/38f2cef33968904d6b6fa56acf83effe.jpg"
  }
]