[
  {
    "author": "DmitryTan",
    "artName": "Как проектировать дизайн на космической скорости?",
    "preview": "Привет, Хабр! Меня зовут Дима Тан, я лид дизайнер продуктовой фабрики и цифровых каналов и инструментов обслуживания клиентов корпоративного и малого бизнеса. Хочу рассказать вам о том, как мы за 9 месяцев собрали интернет-банк и что с ним дальше стало.\n\n",
    "tags": [
      "Блог компании ОТП Банк"
    ],
    "timeOfPublication": "Dec 18, 2024, 4:16:00 PM",
    "views": 283,
    "readingTime": 5,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/138/974/415/138974415d1a52b09cafa8abf0bfcf21.png"
  },
  {
    "author": "blanergol_n",
    "artName": "Умная кодогенерация: как AI-платформа помогает строить микросервисную архитектуру",
    "preview": "Привет! Я лид backend-разработки red_mad_robot, Илья Трусов, и я создал инструмент Meroving, который помогает оптимизировать рутинные задачи, а иногда полностью их делает за разработчика. Например, монотонное написание однотипного кода или бесконечное перекладывание JSON-файлов. О том, как создавался и зачем нужен Meroving, рассказываю в статье.\n\n",
    "tags": [
      "Блог компании red_mad_robot",
      "Искусственный интеллект",
      "API",
      "DevOps"
    ],
    "timeOfPublication": "Dec 18, 2024, 4:14:00 PM",
    "views": 1000,
    "readingTime": 8,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/9c8/f9c/a2c/9c8f9ca2c37dd60baedf3c9d2d59a5f5.png"
  },
  {
    "author": "Oksana_Nedvigina",
    "artName": "Арсин для полупроводников и не только: патентный анализ",
    "preview": "\nМы продолжаем рассказывать о различных химических веществах, их применении в электронике и, разумеется, патентом аспекте. На этот раз речь пойдет о AsН3 чистотой шесть девяток. Арси́н — химическое соединение мышьяка и водорода, является аналогом аммиака NH3, фосфина PH3 и стибина H3Sb.\n\n",
    "tags": [
      "Блог компании Online patent",
      "Производство и разработка электроники",
      "Химия",
      "Патентование"
    ],
    "timeOfPublication": "Dec 18, 2024, 4:11:00 PM",
    "views": 357,
    "readingTime": 4,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/848/0df/57a/8480df57adf60ea84e377b32e2cc2afe.png"
  },
  {
    "author": "ru_vds",
    "artName": "Как долго можно извлечь данные из RAM после отключения компьютера?",
    "preview": "",
    "tags": [
      "Блог компании RUVDS.com",
      "Информационная безопасность",
      "Компьютерное железо",
      "Научно-популярное",
      "Хранение данных"
    ],
    "timeOfPublication": "Dec 18, 2024, 4:01:00 PM",
    "views": 7000,
    "readingTime": 11
  },
  {
    "author": "FedExRU",
    "artName": "Как TypeScript помогает решать проблемы обратной совместимости в UI-библиотеках",
    "preview": "Обратная совместимость — одно из ключевых требований к современным UI‑библиотекам, которое стоит в одном ряду с требованиями к удобству использования компонентов и наличию качественной дизайн‑системы. Более того, она должна обеспечивать не только сохранение работоспособности проекта клиента после обновления библиотеки, но и неизменность самого подхода к написанию кода. Последний аспект может бросать определённые вызовы для команды разработки UI‑библиотеки и создавать уникальные сценарии.\nПривет, Хабр! На связи Павел Урядышев, главный ИТ‑инженер Platform V UI Kit в СберТехе. В этом материале я расскажу, с какой необычной проблемой обратной совместимости столкнулась наша команда во время подготовки релиза UI‑библиотеки Platform V UI Kit. Это решение для построения интерфейсов любого уровня сложности: от корпоративных приложений до сайтов.\n\n",
    "tags": [
      "Блог компании Сбер",
      "Интерфейсы",
      "TypeScript"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:50:00 PM",
    "views": 651,
    "readingTime": 13,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/f88/a5f/240/f88a5f2400bc61318525d05d324a17e3.jpg"
  },
  {
    "author": "mrDevGo",
    "artName": "Flutter в своей продакшн-эре и другие откровения на Flutter in Production",
    "preview": "Привет, Хабр! Я Юра Петров, Tech Lead в Friflex и автор телеграм-канала «Мобильный разработчик».\nСмотрели Flutter in Production? В этой статье расскажу, что говорит команда Flutter о прошлом, настоящим и будущем фреймворка, и отмечу, что показалось особенно интересным.\n\n",
    "tags": [
      "Блог компании Friflex",
      "Dart",
      "Flutter",
      "Разработка мобильных приложений"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:37:00 PM",
    "views": 950,
    "readingTime": 4,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/101/c0b/d05/101c0bd059cd0dd3f21a23576539ab72.png"
  },
  {
    "author": "Finam_Broker",
    "artName": "$20 000 000 для хикикомори: история успеха Такаши Котегавы, подловившего банк Mizuho на ошибке",
    "preview": "Иногда ошибки в информационных системах ведут к трагедиям сотен людей, как это было с бухгалтерским софтом Horizon, но иногда и позволяют обогатиться одиночкам, оказавшимся в нужное время в нужном месте. Один из ярчайших примеров – японский трейдер Такаши Котегава, заработавший $20 млн на ошибке сотрудника брокерской компании японского банка Mizuho Financial Group.\nДавайте разберемся, как нажатие не той клавиши сорвало IPO крупной телекоммуникационной компании и как это сделало легендой фондового рынка Котегаву, о чьей странноватой личности и реальных трейдерских талантах до сих пор ведутся жаркие споры.\n\n",
    "tags": [
      "Блог компании Финам",
      "Читальный зал",
      "Научно-популярное",
      "IT-компании",
      "Финансы в IT"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:30:00 PM",
    "views": 3800,
    "readingTime": 5,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/427/39c/393/42739c393edfea85faa6278d543f8f4f.jpg"
  },
  {
    "author": "CTSG",
    "artName": "Кто такие DevSecOps -инженеры и зачем они нужны?",
    "preview": "Добрый день, уважаемые читатели!\nСегодня я расскажу о важной и достаточно новой профессии в IT — DevSecOps -инженерах. Мы разберёмся, кто эти специалисты, чем они занимаются, и почему их роль так важна в современных процессах разработки.\nНемного о себе\nМеня зовут Жиляев Петр, я окончил Московский институт радиоэлектроники и автоматики по специальности \"Информационная безопасность” и я уже более пяти лет работаю в области информационной безопасности.\nСегодня я занимаюсь внедрением DevSecOps-методологий и процессами сертификации программного обеспечения.\nЧто такое DevSecOps?\n",
    "tags": [
      "Блог компании Crosstech Solutions Group"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:30:00 PM",
    "views": 556,
    "readingTime": 5,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/cb6/fc3/edb/cb6fc3edb1cadff9f673a9021d55a564.png"
  },
  {
    "author": "Axelus",
    "artName": "CRM 2025: прогноз для малого и среднего бизнеса",
    "preview": "Каждый год я сажусь и пишу прогноз рынка CRM на новый год. Бывает приятно видеть, как что-то сбывается и отчасти оказывается визионерским. Бывает сложно — таким был «коронавирусный» прогноз на 2021 год. Но это не праздная статья для Хабра, это всегда возможность сесть, подумать, переосмыслить и пощупать тренды, среди которых предстоит жить целый год. Думаю, это также важно для компаний, которые только приступают к автоматизации или о ней пока не задумывались (к счастью, таких всё меньше). Каждому прогнозу предшествует полное погружение в разработку своей CRM-системы почти 365 дней в году, ну и свыше 25 лет опыта как бонус. Здесь не будет сенсаций и откровений, как у хостеров, не будет захватывающих историй, как у когтеточек, — просто профессиональный взгляд на сложную и важную часть автоматизации бизнеса. Но профессиональный — не значит, скучный. В общем, поехали.\n",
    "tags": [
      "Блог компании RegionSoft",
      "CRM-системы",
      "IT-инфраструктура",
      "Софт",
      "Исследования и прогнозы в IT"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:20:00 PM",
    "views": 841,
    "readingTime": 7,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/e47/a6d/b6f/e47a6db6f86c0d3aff9f7252873578ec.png"
  },
  {
    "author": "severstal",
    "artName": "Цифровизация «Северстали»: раннее выявление и устранение неисправностей",
    "preview": "Здравствуйте! Меня зовут Осминкин Ярослав, я работаю руководителем службы мониторинга состояния оборудования дирекции по ремонтам, и сегодня я поделюсь с вами нашим опытом из компании «Северсталь» по использованию цифровых инструментов для раннего выявления неисправностей оборудования и предотвращения отказов.\nГлавной задачей наших ремонтных служб, как и у ремонтных подразделений любой крупной промышленной компании, является обеспечение бесперебойной работы основных технологических агрегатов и удержание необходимого коэффициента технической готовности (КТГ). Только при стабильной и надёжной работе оборудования можно оперативно выполнять производственные задачи и поддерживать темпы выпуска продукции.\nПонимание важности надёжности оборудования привело нас к тому, что ещё в начале 2010-х годов в «Северстали» стартовала масштабная трансформация функции ремонтов. Мы разработали и внедрили методику технического обслуживания, ориентированную на надёжность, которую в нашей компании называют «Колесо ТООН».\n\n",
    "tags": [
      "Блог компании Северсталь",
      "IT-инфраструктура"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:07:00 PM",
    "views": 817,
    "readingTime": 16,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/834/66c/d65/83466cd65001d3e8fbe35531bc069635.jpg"
  },
  {
    "author": "0f6m",
    "artName": "Remote Code Execution в Widget Options (WordPress Plugin) — CVE-2024-8672",
    "preview": "28 ноября 2024 года в плагине Widget Options для WordPress, который установлен более чем на 100,000 сайтах, была выявлена критическая уязвимость с CVSS 9.9. Уязвимость позволяет выполнять удалённое исполнение вредоносного кода. Рассмотрим процесс установки уязвимой версии плагина, а также пример эксплуатации уявзимости.\n\n",
    "tags": [
      "Информационная безопасность",
      "Тестирование веб-сервисов",
      "Тестирование IT-систем"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:01:00 PM",
    "views": 186,
    "readingTime": 5,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/cdd/e27/136/cdde27136dbc0554b3adccf18606dc51.jpg"
  },
  {
    "author": "techno_mot",
    "artName": "Самые дерзкие фишинговые схемы 2024 года, которые сработали",
    "preview": "",
    "tags": [
      "Блог компании Selectel",
      "IT-инфраструктура",
      "IT-компании",
      "Информационная безопасность"
    ],
    "timeOfPublication": "Dec 18, 2024, 3:00:00 PM",
    "views": 7100,
    "readingTime": 10
  },
  {
    "author": "adshpagin",
    "artName": "Качество видео в онлайн-звонке: как его оценить и какие инструменты использовать",
    "preview": "В наше время онлайн-встречи стали привычной практикой. Появилась возможность общаться по видеосвязи из разных концов мира, что значительно упростило коммуникацию. Но иногда эта связь может подвести. К примеру, падает качество изображения: возникают артефакты, нечёткость картинки.\nМеня зовут Алексей Шпагин. Я руковожу командой бэкенда проекта VK Звонки. В нашем сервисе видеоконференций можно проводить групповые звонки без ограничений по времени и количеству участников, совместно просматривать видео, а также демонстрировать экран в формате 4К. В этой статье расскажу, почему может снижаться качество транслируемого изображения, как эту проблему решить и какими инструментами оценивать результаты. Чтобы подкрепить рассуждения, в качестве примеров я буду использовать кейсы VK Звонков.\nВ 2022 году я рассказывал про оценку качества звука на конференции HighLoad++. Статья об этом уже есть на Хабре. В этом материале я буду делать отсылки к ней, так как есть сходство между тем, как передаются видео и звук через интернет.\n\n",
    "tags": [
      "Блог компании VK",
      "Видеоконференцсвязь",
      "Работа с видео"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:51:00 PM",
    "views": 282,
    "readingTime": 9,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/deb/9df/461/deb9df461202fc8cc6ed0b9c249a9e1a.jpeg"
  },
  {
    "author": "Top3DShop",
    "artName": "Изготовление костей: применение 3D-печати в медицине",
    "preview": "Вы когда-нибудь задумывались, как ученые изучают распространение рака в костях? Традиционно эти исследования сильно зависели от испытаний на животных, но исследователи из Института Генри Ройса при Манчестерском университете революционизируют эту область, используя технологию 3D-печати(биопечать) для создания сложных моделей костей в лаборатории. Этот инновационный подход может значительно сократить потребность в тестах на животных, обеспечивая более контролируемые и воспроизводимые условия для изучения костной ткани. Например, в лаборатории можно точно регулировать состав среды, количество питательных веществ и физические параметры, такие как температура и давление, что невозможно при работе с живыми организмами. Это позволяет получать более точные и воспроизводимые результаты.\n\n",
    "tags": [
      "Блог компании Top 3D Shop",
      "3D-принтеры"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:46:00 PM",
    "views": 362,
    "readingTime": 4,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/773/2aa/f1a/7732aaf1aac389e652d5bd0f51f72fb0.jpg"
  },
  {
    "author": "markshevchenko",
    "artName": "История о том, как мы собирали разработчиков Nix в России и… собрали",
    "preview": "Несколько месяцев назад я писал, как мы ввязались в авантюру — решили собрать в России программистов со всего мира. Не всех, конечно, а тех, кто занимается пакетным менеджером Nix и операционной системой NixOS. Разработчики Nix когда-то решили, что делать большой проект без личного общения им не нравится, поэтому раз или два в год они собираются где-то на земном шаре и пишут код вместе. Такие встречи называются спринты. Февральский спринт прошёл в Таиланде, а летом мы провели его в Казани. Под катом — история о том, что у нас получилось, а что — нет.\n",
    "tags": [
      "Разработка под Linux",
      "Хакатоны",
      "Developer Relations",
      "Open source"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:45:00 PM",
    "views": 1200,
    "readingTime": 6,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/d84/876/02c/d8487602c166f17ec3999137b32ff8b8.jpg"
  },
  {
    "author": "kuksepa",
    "artName": "AWX: упрощаем работу с Ansible",
    "preview": "Привет, на связи Ксения Кузьменко, DevOps-инженер департамента по организации выпуска продуктов YADRO. Наша DPS-команда предоставляет платформенные сервисы для 40+ команд и 1000+ пользователей внутри компании. Мы работаем с сотнями виртуальных машин в различных локациях. Каждый день прогоняем более 250 плейбуков, из них часть связаны между собой в сложные последовательности. Конечно, инструмент для упрощения работы с Ansible был в нашей дорожной карте еще на этапе планирования.\nПочему мы выбрали AWX, какие задачи решили и приятные «плюшки» получили, я расскажу в статье. О некоторых подводных камнях — тоже.\nНужен ли AWX в вашей команде? На этот вопрос вы ответите сами, прочитав текст под катом. Я максимально подробно описала наш опыт с Ansible AWX. Если появятся вопросы — пишите в комментариях, отвечу.\n\n",
    "tags": [
      "Блог компании YADRO",
      "DevOps",
      "Системное администрирование"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:40:00 PM",
    "views": 2200,
    "readingTime": 12,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/3af/a51/ea2/3afa51ea2955c1fdd33c0320ff732d47.jpg"
  },
  {
    "author": "stepan_littlehorse",
    "artName": "Переводим 50 приложений на Module Federation и ничего не ломаем",
    "preview": "Привет, меня зовут Степан, я главный frontend-разработчик в Альфа-Банке. Проектом, о котором пойдёт речь, занимается наша команда. Только фронтенд-разработчиков в ней 60. Множество команд поддерживают более 50 приложений, приносящих прибыль бизнесу.\nУ нас ранее были микрофронты, но они были построены не на WMF. Не вдаваясь в документацию, давайте покажу, как всё было устроено, чтобы описать причины переезда. Думаю, будет интересно, учитывая, что проект большой.\nЯ расскажу о микрофронтендах и сопутствующей концепции Model Federation на примере большого проекта.\n\n",
    "tags": [
      "Блог компании Альфа-Банк",
      "Микросервисы",
      "Веб-разработка",
      "JavaScript",
      "Анализ и проектирование систем"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:32:00 PM",
    "views": 612,
    "readingTime": 12,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/0dc/577/e8e/0dc577e8efa4ee4b8232ce089fce958e.png"
  },
  {
    "author": "olegvishnevsky",
    "artName": "Как подготовить печатные макеты из Figma в Adobe Illustrator так, чтобы типография не взвыла? Личный опыт и советы",
    "preview": "Цель этой статьи – поделиться своим опытом и в комментариях сообщества обсудить ваши лайфхаки. Не претендую на истину в последней инстанции, и понимаю, что профессионалы часто смеются над использованием Figma для предпечатки, как и некоторые иронизируют над использованием Corel Draw.\nДавайте разберёмся, что именно может пойти не так при подготовке к печати из Figma и почему.\n\n",
    "tags": [
      "Графический дизайн",
      "Дизайн"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:29:00 PM",
    "views": 938,
    "readingTime": 5,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/f03/22a/ebe/f0322aebe26714984c848fd4e37e6e9d.jpeg"
  },
  {
    "author": "SShulgin",
    "artName": "Чем заменить F5 и А10? Обзор рынка балансировщиков нагрузки и наши рекомендации по выбору решения",
    "preview": "Без балансировщиков нагрузки не может стабильно работать ни одно высоконагруженное приложение. Поэтому уход с рынка западных вендоров, решениями которых все спокойно пользовались, озадачил огромное число заказчиков. Нас, как интегратора, признаться, тоже.\nЧтобы понимать, что дальше предлагать компаниям, мы постоянно следим за рынком и составляем свои шорт-листы производителей, которые сопоставимы по уровню своей продукции с ушедшими вендорами и активно развивают свои продукты. У нас есть испытательная лаборатория, где мы тестируем оборудование и ПО в сценариях наших клиентов. И, конечно, многие решения мы уже внедряем в проектах.\nВ этой статье я расскажу, какие продукты сейчас вообще есть на рынке, приведу сравнение ключевых вендоров и поделюсь нашим мнением о том, как выбрать оптимальное решения под свои задачи.\n\n",
    "tags": [
      "Блог компании К2Тех",
      "Сетевые технологии"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:08:00 PM",
    "views": 721,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/349/67b/d8c/34967bd8cd9d964abf3af429cd4e54aa.jpeg"
  },
  {
    "author": "Zextras",
    "artName": "Включение веб-интерфейса CBPolicyD в Carbonio",
    "preview": "Ранее мы рассказывали о том, как настраивать различные почтовые политики во встроенном в Carbonio модуле CBPolicyD за счет правки таблиц в базе данных SQLite3. Такие политики позволяют настроить различные ограничения для пользователей, запретив им получать или отправлять больше заданного администратором количества писем, ограничить круг отправителей, способных отправлять письма получателям на сервере и так далее. В данной статье мы расскажем о том, как настроить веб-интерфейс CBPolicyD, чтобы сделать процесс настройки более простым и наглядным.\n\n",
    "tags": [
      "Блог компании Zextras",
      "Софт",
      "Системное администрирование"
    ],
    "timeOfPublication": "Dec 18, 2024, 2:00:00 PM",
    "views": 117,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/f4b/4c8/700/f4b4c8700505f23d47c00a79692e7bc7.png"
  }
]