[
  {
    "author": "GordienkoAnd",
    "artName": "Как настраивать сети: выделенный и облачный серверы",
    "preview": "",
    "tags": [
      "Блог компании Selectel",
      "IT-инфраструктура",
      "IT-компании",
      "Облачные сервисы",
      "Сетевые технологии"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:23:00 AM",
    "views": 17,
    "readingTime": 21
  },
  {
    "author": "mClouds_editor",
    "artName": "El Capitan: что внутри самого мощного суперкомпьютера в мире и зачем еще он нужен",
    "preview": "Привет! На связи команда mClouds. Недавно узнали, что в рейтинге самых мощных суперкомпьютеров Top500 сменился лидер — первое место занял El Capitan с производительностью 1,742 экзафлопса.\nМы разобрались, что находится внутри самого мощного суперкомпьютера, а также для чего создали такую махину. Заодно порассуждали, что нам стоит ждать от суперкомпьютеров дальше — будет ли это только рост классических вычислений или что-то действительно революционное.\n\n",
    "tags": [
      "Блог компании mClouds.ru",
      "Суперкомпьютеры",
      "IT-инфраструктура",
      "Компьютерное железо",
      "Читальный зал"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:21:00 AM",
    "views": 12,
    "readingTime": 6,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/d28/a4e/526/d28a4e526c681f9fa8fa29bb41d8b084.png"
  },
  {
    "author": "Digital_League",
    "artName": "Ребрендинг T2: как мы полностью переработали digital-пространство компании",
    "preview": "В феврале 2024 года стартовал секретный проект по ребрендингу Tele2: шведская франшиза заканчивалась, и мобильный оператор не планировал её продлевать. Проект по обновлению стиля коснулся и digital-платформы.\nНужно было переделать цифровое пространство Tele2 с большим количеством пользовательских сценариев под актуальные требования Т2. Это было сделано силами команды разработки T2 с помощью экспертов Лиги Цифровой Экономики.\nВ статье опустим детальные технические выкладки и кодовую базу: все инструменты и применяемые подходы сами по себе в настоящий момент достаточно стандартны. Мы поделимся вызовами, которые встали перед командами в рамках редизайна, и комплексным подходом к решению, который позволил в короткие сроки получить результат.\nВ чем сложность проекта?\nЭто тот случай, когда горящую задачу важно было решить комплексно и качественно. При этом нужно было заложить надежные рельсы на будущее, а не ограничиться рабочим решением, которое сделано в сжатые сроки, но требует отработки техдолга.\nВ проекте нужно было решить сразу ряд параллельных задач, в чем и заключалась сложность. Это:\n\n",
    "tags": [
      "Блог компании t2",
      "Блог компании Лига Цифровой Экономики"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:20:00 AM",
    "views": 10,
    "readingTime": 6,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/fb9/a4e/0c1/fb9a4e0c18247183c7b3a4f1e766becf.jpg"
  },
  {
    "author": "stinker",
    "artName": "Opensearch, Logstash и dynamic mapping",
    "preview": "У нас в Домклик огромное количество микро-сервисов, около 5000. Все они пишут какие-то логи. В этой статье я хочу рассказать о том, как у нас в компании настроен маппинг в индексах Opensearch и какие \"фишки\" мы используем, чтобы минимизировать работы по настройке маппинга.\n\n",
    "tags": [
      "Блог компании Домклик",
      "Системное администрирование"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:19:00 AM",
    "views": 41,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/672/5d8/5ae/6725d85aefa9226aff3adaa21f75ce9d.jpg"
  },
  {
    "author": "LoshadkaNaRabote",
    "artName": "E-mail аутрич или как мы скатились к холодной рассылке",
    "preview": "Год назад, изучая, что там нового «переизобрели» в маркетинге, наткнулась на email‑outreach. Изучила новое явление и закрыла — зуммеры опять переназывают наши инструменты из 10х и нулевых.\nНо вот один кейс на vc, вот второй — и как из рога изобилия посыпались кейсы на лярдовые сделки, совершенные благодаря чудо‑инструменту.\n",
    "tags": [
      "Email-маркетинг",
      "Интернет-маркетинг",
      "Повышение конверсии"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:15:00 AM",
    "views": 23,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/9e2/b52/6a9/9e2b526a9cf674d4ef5df3826650baba.jpg"
  },
  {
    "author": "trone_007",
    "artName": "Как хранить деревья или как мы меняли инструмент «Структура компании»",
    "preview": "Привет, меня зовут Степан Золотухин, я разработчик в Битрикс24. Моя команда работает над такими продуктами, как Почта, Маркетинг, Структура компании, Подписание, CRM-Формы.\nМы делаем очень много клевых и интересных фич, но в этой статье я расскажу о том, как мы работаем с «деревьями» на примере нашего продукта «Структура компании».\n\n",
    "tags": [
      "Блог компании Битрикс24",
      "PHP",
      "SQL"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:12:00 AM",
    "views": 72,
    "readingTime": 7,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/fb0/4dd/802/fb04dd802a3c4f9498f54cd1431f7457.jpg"
  },
  {
    "author": "OldFashionedEngineer",
    "artName": "Защита схемы от переполюсовки, что может быть проще?",
    "preview": "",
    "tags": [
      "Блог компании Timeweb Cloud",
      "Производство и разработка электроники",
      "Схемотехника",
      "Электроника для начинающих"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:05:00 AM",
    "views": 329,
    "readingTime": 15
  },
  {
    "author": "iVolynkin",
    "artName": "Анатомия виртуального сотрудника: от смыслов до каналов",
    "preview": "Привет, Хабр! Меня зовут Илья Волынкин, я технический директор МТС Exolve. Когда мы говорим про коммуникации, то обычно представляем себе двух человек, общающихся либо в чате, либо голосом. В современном мире такая схема встречается все реже: появляются разные боты, новые каналы связи, которые еще и действуют параллельно. Так возникают сложные системы для голосовых коммуникаций — омниканальные роботы. В статье я расскажу об их основных архитектурных паттернах, применении ИИ-моделей и возникновении новых и непривычных решений.\n\n",
    "tags": [
      "Блог компании МТС",
      "Облачные сервисы",
      "Голосовые интерфейсы",
      "Будущее здесь",
      "Искусственный интеллект"
    ],
    "timeOfPublication": "Dec 19, 2024, 11:00:00 AM",
    "views": 77,
    "readingTime": 7,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/f98/c0b/796/f98c0b7960d9fc4fa7c4eb6b40b24514.jpg"
  },
  {
    "author": "sacredtree",
    "artName": "Чёрное солнце. Что такое мурмурация, как роение двигает науку и при чем здесь каннибализм",
    "preview": "Sort sol — «чёрное солнце». За зловещим названием скрывается, в общем-то, обычное для датской Ютландии явление. По весне и осени праздные туристы, груженые оптикой орнитологи и вертлявые фотографы наведываются в эти хмурые края, чтобы понаблюдать за метаморфирующими облаками скворичных стай. Птицы собираются на ночевку огромными, до миллиона особей, группами и порой застилают собой все небо, отчего солнце словно и правда гаснет раньше, чем обычно.\nМиру подобное явление скоординированного полета птиц известно как мурмурация (от лат. murmuratio — «бормотание»). Несмотря на кажущуюся сложность, в своей сути оно подчиняется определенным алгоритмам — как и другие модели роевого поведения. В этом тексте поговорим о том, как устроена мурмурация, практикуют ли роение homo sapiens, какие существуют хайв-технологии и как сделать, чтобы коллеги по стае тебя не съели. Но обо всем по порядку.\n\n",
    "tags": [
      "Блог компании Газпромбанк",
      "Научно-популярное",
      "Читальный зал"
    ],
    "timeOfPublication": "Dec 19, 2024, 10:46:00 AM",
    "views": 304,
    "readingTime": 11,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/98e/5f1/d52/98e5f1d52cf79b78108dc1ff8f2f3da0.jpg"
  },
  {
    "author": "kentavr009",
    "artName": "Парсинг поисковой выдачи Google по ключевым словам — подробный гайд как сделать парсер Гугл (аналог вордстат в Гугл)",
    "preview": "Любой SEO специалист знает, какая боль собирать семантику для Гугла. Одно дело, когда запросы можно пересчитать по пальцам, а когда они исчисляются тысячами, а не штуками? Как посмотреть количество запросов в Гугл по ключевым словам? Честно говоря, когда речь заходит о десятках тысяч ключевых слов, становится не по себе — голова идёт кругом, руки тянутся к старым привычным инструментам, а реальность бросает вызов. Так уж устроен сегодняшний Google Ads: привычная связка Key Collector + Google Ads + несколько прокси больше не спасает. Наступает новая эпоха, где без прямого обращения к официальному API всё становится мрачно и сложно.\n\n",
    "tags": [
      "Python",
      "Google API",
      "Google Cloud Platform"
    ],
    "timeOfPublication": "Dec 19, 2024, 10:31:00 AM",
    "views": 173,
    "readingTime": 9,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/b27/256/b90/b27256b90e689bbf4999dbea9281bc26.jpg"
  },
  {
    "author": "Xcom-shop",
    "artName": "Илон Маск сделал бесплатным чат-бот Grok от xAI. Что он умеет и почему это круто",
    "preview": "Если вы только что вылезли из-под камня или вернулись с Марса, то вам нужно срочно знать: Grok, чат-бот Илона Маска, теперь стал доступен бесплатно. Это не просто новость, а настоящий прорыв в мире техники и общения с искусственным интеллектом. Давайте разберёмся, почему Grok – это ваш новый лучший друг и как вы можете использовать его на полную катушку.\n\n",
    "tags": [
      "Блог компании Группа компаний X-Com",
      "Искусственный интеллект",
      "Обработка изображений"
    ],
    "timeOfPublication": "Dec 19, 2024, 10:22:00 AM",
    "views": 1000,
    "readingTime": 4,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/45b/9fa/348/45b9fa348a70c72b02d0ce6aada04375.jpeg"
  },
  {
    "author": "Aza_Misakyan",
    "artName": "Django или Flask: какой фреймворк лучше подходит для вашего проекта?",
    "preview": "Flask и Django — два ведущих веб-фреймворка на языке Python, каждый из которых обладает уникальными особенностями и преимуществами. Они широко используются для создания и управления веб-приложениями, сервисами и сайтами. В этой статье мы подробно рассмотрим различия между Flask и Django, их ключевые характеристики, преимущества и недостатки, чтобы помочь вам выбрать наиболее подходящий инструмент для ваших проектов в 2024 году.\n\n",
    "tags": [
      "Django",
      "Flask"
    ],
    "timeOfPublication": "Dec 19, 2024, 10:16:00 AM",
    "views": 350,
    "readingTime": 5
  },
  {
    "author": "dennus",
    "artName": "Безопасность на высоте: как защищать API сегодня",
    "preview": "К 2030 году количество используемых в мире API составит около 2 миллиардов. Это в 8 раз больше, чем в 2018 году. Рост числа открытых точек увеличивает количество уязвимостей, угроз и прогнозируемых атак. По оценкам экспертов, к 2026–2027 годам рост прогнозируемых атак на API составит 156% от сегодняшнего состояния.\nМеня зовут Денис Кириллов, я главный архитектор решения Platform V SOWA в СберТехе. Сегодня я хотел бы рассказать о лучших практиках защиты API в современном мире. Эта тема довольно обширная, поэтому я разделил её на два материала. В первой статье рассмотрим принципы безопасности API, спецификации API и как они влияют на безопасность. Поговорим о проверке объектов на соответствие спецификации и о том, как она помогает снизить риски из списка Тор-10 API Security Risks.\nВо второй статье расскажу о проблемах валидации API и совместном использовании механизмов валидации и WAF. Выясним, почему необходим отдельный компонент, который реализовывал бы функцию безопасности по отношению к API. И рассмотрим возможности продукта Platform V SOWA, который мы создали для решения этих задач.\nМатериал будет полезен специалистам в области информационной безопасности, сопровождения и разработки.\n\n",
    "tags": [
      "Блог компании Сбер",
      "API",
      "Информационная безопасность"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:52:00 AM",
    "views": 437,
    "readingTime": 10,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/1c0/e25/e30/1c0e25e30fdbe520590370e7c9de0545.jpg"
  },
  {
    "author": "RationalAnswer",
    "artName": "Андрей Мовчан считает, что даже средний хедж-фонд смог обогнать S\u0026P500 за последние 25 лет (а я нет)",
    "preview": "Как известно, хедж-фонды платят ундециллионы денег самым умным и способным управляющим – наверное, для них не составит труда обогнать пассивный индекс акций? В этой статье мы попробуем зарыться в данные и в деталях разобраться, действительно ли это так, и в чем может быть проблема с вынесенным в заголовок тезисом.\n\n",
    "tags": [
      "Финансы в IT"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:32:00 AM",
    "views": 1400,
    "readingTime": 10,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/607/8af/938/6078af938535285aa8dbca2a412e7800.jpg"
  },
  {
    "author": "olegantipovDDG",
    "artName": "Петь в такт машине: история караоке и устройство его аппаратов",
    "preview": "Японское изобретение давно стало привычной частью нашей реальности. Многие отводят душу в караоке по вечерам, одни или в веселой компании. Задумывались ли вы когда-нибудь, как караоке-аппараты считают баллы, которые по итогам исполнения присуждаются отважным певцам? Совершим небольшое путешествие в историю этого изобретения и заглянем внутрь механизма его работы.\n\n",
    "tags": [
      "Блог компании DDoS-Guard",
      "Читальный зал",
      "Алгоритмы",
      "Звук",
      "Старое железо"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:20:00 AM",
    "views": 358,
    "readingTime": 9,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/c11/7b4/ad7/c117b4ad7b01e650b74bbad346f8afe1.jpg"
  },
  {
    "author": "Dima_cloud",
    "artName": "Как мы настроили планировщик, чтобы разогнать виртуальные серверы",
    "preview": "Секрет Полишинеля, что общая производительность нарезанного на виртуальные хосты сервера снижается. Проблема возникает, если эти потери становятся настолько значительны, что тормозят работу программ. Делюсь опытом, как нам удалось решить эту задачу. В нашем случае, серверы были настроены для работы с 1С.\n\n",
    "tags": [
      "1С",
      "Microsoft SQL Server",
      "Облачные сервисы",
      "Виртуализация",
      "Серверная оптимизация"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:15:00 AM",
    "views": 513,
    "readingTime": 3,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/e3d/c12/e03/e3dc12e034ec17a7347129ce01e62a1a.jpg"
  },
  {
    "author": "aymericzip",
    "artName": "Интернационализация (i18n) бэкенда в Express с использованием Intlayer",
    "preview": "Недавно мне понадобилось добавить поддержку нескольких языков в API на базе Express. Я решил поделиться кратким руководством для тех, кто хочет сделать свой бэкенд отвечающим переведенным контентом в зависимости от предпочтительного языка пользователя.\n",
    "tags": [
      "JavaScript",
      "TypeScript",
      "Node.JS",
      "Веб-разработка",
      "Программирование"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:15:00 AM",
    "views": 90,
    "readingTime": 2,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/e8d/dad/bf2/e8ddadbf280a25778d368c569d51b861.png"
  },
  {
    "author": "SIISII",
    "artName": "Процессор ЭВМ ЕС-1030. Блок обращения к оперативной памяти",
    "preview": "В этой статье рассматривается устройство и логика работы блока обращения к оперативной памяти процессора ЭВМ ЕС-1030.\n\n",
    "tags": [
      "История IT",
      "Процессоры"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:13:00 AM",
    "views": 299,
    "readingTime": 21,
    "picURL": "https://habrastorage.org/r/w780/getpro/habr/upload_files/e9f/5cd/8c4/e9f5cd8c48bbc6afdc3998cd8ecf89a9.jpg"
  },
  {
    "author": "gserge",
    "artName": "Менеджмент менеджмента: как во «Фланте» внедрили принятие решений эфемерными рабочими группами",
    "preview": "Впервые со сложностью согласованного принятия решений менеджеры «Фланта» столкнулись в 2022 году. Компания сильно выросла, и нужно было синхронизировать процессы в разных командах, развивать межкомандные коммуникации, продажи и управление бюджетом.\nЧисло руководителей уже не позволяло выбирать решения единогласно. Мы пробовали собрать рабочие группы по пяти основным направлениям задач, но быстро выяснилось, что их состав недостаточно гибкий. Гораздо более эффективным подходом оказались эфемерные рабочие группы для решения каждой конкретной проблемы. В статье рассказываем, как они появились и работают.\n\n",
    "tags": [
      "Блог компании Флант",
      "Agile",
      "Управление проектами",
      "Удалённая работа",
      "Управление персоналом"
    ],
    "timeOfPublication": "Dec 19, 2024, 9:00:00 AM",
    "views": 351,
    "readingTime": 7,
    "picURL": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/62e/554/98c/62e55498c18ba1e406a38b747ac84784.png"
  },
  {
    "author": "legalboss",
    "artName": "Cкрытое владение бизнесом в России — является ли схема преступлением по ст. 173.1 и 173.2 Уголовного кодекса РФ",
    "preview": "В сети появляется всё больше информации о незаконности схемы скрытого владения бизнесом и отождествления её с преступлениями, предусмотренными статьями 173.1 и 173.2 УК РФ. В этой статье разберём, так ли это на самом деле и как законно и безопасно оформить указанную схему на практике с помощью опциона, корпоративного и наследственного договоров.\nПоскольку абсолютное большинство компаний в России инкорпорированы в организационно-правовой форме ООО, то в данной статье я буду рассматривать скрытое владение бизнесом в контексте этого вида юридического лица.\n\n",
    "tags": [
      "Управление проектами"
    ],
    "timeOfPublication": "Dec 19, 2024, 8:56:00 AM",
    "views": 613,
    "readingTime": 12
  }
]